
&НаКлиенте
Процедура ПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
				
	СтандартнаяОбработка = Ложь;
	//Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "*(*.*)|*.*";
	Диалог.Каталог = Запись.Путь ;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Путь ";
	Если Диалог.Выбрать() Тогда		
    Запись.Путь = Диалог.каталог;
	Запись.Название = СтрЗаменить(Диалог.ПолноеИмяФайла, Диалог.Каталог, "") 
	КонецЕсли;



КонецПроцедуры

//Типа не используемые процедуры
//&НаКлиенте
//Процедура Отрыть(Команда)
//	// Вставить содержимое обработчика.
//	ЗапуститьПриложение(Запись.Путь+Запись.Название);
//КонецПроцедуры
//
//&НаКлиенте
//Процедура ОткрытьКаталог(Команда)
//	// Вставить содержимое обработчика.
//	ЗапуститьПриложение(Запись.Путь);
//КонецПроцедуры

&НаКлиенте
Процедура ПутьОткрытие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = ЛОжь;
	ЗапуститьПриложение(Запись.Путь);
КонецПроцедуры

&НаКлиенте
Процедура НазваниеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОжь;
	ЗапуститьПриложение(Запись.Путь+Запись.Название);

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	
КонецПроцедуры

